# Deploy de aplicações

## Aula 1 - Tratando os dados

In [32]:
import pandas as pd

In [33]:
cadastrados = pd.read_csv("https://raw.githubusercontent.com/FIAP/Pos_Tech_DTAT/dd201a034223a16732c6f639b40600b26bd3129c/dados/clientes_cadastrados.csv")

In [34]:
cadastrados.head()

,ID_Cliente,Genero,Tem_carro,Tem_casa_propria,Qtd_filhos,Rendimento_anual,Categoria_de_renda,Grau_escolaridade,Estado_civil,Moradia,Idade,Anos_empregado,Tem_celular,Tem_telefone_trabalho,Tem_telefone_fixo,Tem_email,Ocupacao,Tamanho_familia
0,5008804,M,Y,Y,0,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Empregado,Ensino médio,Casado,Casa/apartamento próprio,-21474,-1134,1,0,0,0,Segurança,2.0
3,5008808,F,N,Y,0,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,-19110,-3051,1,0,1,1,Vendas,1.0
4,5008809,F,N,Y,0,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,-19110,-3051,1,0,1,1,Vendas,1.0

In [35]:
cadastrados.shape #quantidade de linhas e colunas

(438557, 18)

In [36]:
cadastrados["ID_Cliente"].value_counts() #contando quantos id tem iguais, mostrando que tem dados duplicados

ID_Cliente
7137299    2
7702238    2
7282535    2
7243768    2
7050948    2
          ..
5690727    1
6621262    1
6621261    1
6621260    1
6842885    1
Name: count, Length: 438510, dtype: int64

In [37]:
id_repetidos = cadastrados[cadastrados["ID_Cliente"].duplicated(keep=False)] #mostrando as informações que estão duplicadas

In [38]:
df_cadastrados_limpo = cadastrados.drop(id_repetidos.index) #limpando os dupplicados

In [39]:
df_cadastrados_limpo["ID_Cliente"].value_counts()

ID_Cliente
5008804    1
6147691    1
6147689    1
6147688    1
6147685    1
          ..
6093492    1
5690720    1
6538938    1
6538937    1
6842885    1
Name: count, Length: 438463, dtype: int64

In [40]:
df_cadastrados_limpo.isnull().sum() #vendo se tem dados nulos e somando a quantidade em cada coluna

ID_Cliente                    0
Genero                        0
Tem_carro                     0
Tem_casa_propria              0
Qtd_filhos                    0
Rendimento_anual              0
Categoria_de_renda            0
Grau_escolaridade             0
Estado_civil                  0
Moradia                       0
Idade                         0
Anos_empregado                0
Tem_celular                   0
Tem_telefone_trabalho         0
Tem_telefone_fixo             0
Tem_email                     0
Ocupacao                 134177
Tamanho_familia               0
dtype: int64

In [41]:
df_cadastrados_limpo["Ocupacao"].unique() #mostrando as informações na coluna escolhida

array([nan, 'Segurança', 'Vendas', 'Contabilidade', 'Construção Civil',
       'Gerência', 'Motorista', 'Equipe principal', 'Alta tecnologia',
       'Limpeza', 'Serviço privado', 'Cozinha', 'Baixa qualificação',
       'Medicina', 'Secretariado', 'Garçom', 'RH', 'Corretor imobiliário',
       'TI'], dtype=object)

In [42]:
df_cadastrados_limpo.fillna({'Ocupacao': 'Outro'}, inplace=True) #colocando informações onde está nulo

In [43]:
df_cadastrados_limpo.isnull().sum()

ID_Cliente               0
Genero                   0
Tem_carro                0
Tem_casa_propria         0
Qtd_filhos               0
Rendimento_anual         0
Categoria_de_renda       0
Grau_escolaridade        0
Estado_civil             0
Moradia                  0
Idade                    0
Anos_empregado           0
Tem_celular              0
Tem_telefone_trabalho    0
Tem_telefone_fixo        0
Tem_email                0
Ocupacao                 0
Tamanho_familia          0
dtype: int64

In [44]:
df_cadastrados_limpo.nunique() #número de valores em cada coluna

ID_Cliente               438463
Genero                        2
Tem_carro                     2
Tem_casa_propria              2
Qtd_filhos                   12
Rendimento_anual            866
Categoria_de_renda            5
Grau_escolaridade             5
Estado_civil                  5
Moradia                       6
Idade                     16379
Anos_empregado             9406
Tem_celular                   1
Tem_telefone_trabalho         2
Tem_telefone_fixo             2
Tem_email                     2
Ocupacao                     19
Tamanho_familia              13
dtype: int64

In [45]:
df_cadastrados_limpo.drop("Genero", axis=1, inplace=True) #excluindo a coluna, axis indica que é coluna

In [46]:
df_cadastrados_limpo.drop("Tem_celular", axis=1, inplace=True)

In [47]:
df_cadastrados_limpo["Tem_carro"].unique()

array(['Y', 'N'], dtype=object)

In [48]:
df_cadastrados_limpo['Tem_casa_propria'].unique()

array(['Y', 'N'], dtype=object)

In [49]:
df_cadastrados_limpo['Tem_telefone_trabalho'].unique()

array([1, 0], dtype=int64)

In [50]:
df_cadastrados_limpo['Tem_telefone_fixo'].unique()

array([0, 1], dtype=int64)

In [51]:
df_cadastrados_limpo['Tem_email'].unique()

array([0, 1], dtype=int64)

In [52]:
df_cadastrados_limpo.info()

<class 'pandas.DataFrame'>
Index: 438463 entries, 0 to 438556
Data columns (total 16 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Cliente             438463 non-null  int64
 1   Tem_carro              438463 non-null  object
 2   Tem_casa_propria       438463 non-null  object
 3   Qtd_filhos             438463 non-null  int64
 4   Rendimento_anual       438463 non-null  float64
 5   Categoria_de_renda     438463 non-null  object
 6   Grau_escolaridade      438463 non-null  object
 7   Estado_civil           438463 non-null  object
 8   Moradia                438463 non-null  object
 9   Idade                  438463 non-null  int64
 10  Anos_empregado         438463 non-null  int64
 11  Tem_telefone_trabalho  438463 non-null  int64
 12  Tem_telefone_fixo      438463 non-null  int64
 13  Tem_email              438463 non-null  int64
 14  Ocupacao               438463 non-null  object
 15  Tamanho_familia        438463 non-null  float64
dtypes: float64(2), int64(7), object(7)
memory usage: 56.9+ MB

In [53]:
df_cadastrados_limpo["Tem_carro"] = df_cadastrados_limpo["Tem_carro"].replace(["Y","N"], [1,0]) #substituindo o valores Y para 1 e N para 2 da coluna "tem_carro"

In [54]:
df_cadastrados_limpo['Tem_casa_propria'] = df_cadastrados_limpo['Tem_casa_propria'].replace(['Y','N'],[1,0])

In [55]:
df_cadastrados_limpo.head()

,ID_Cliente,Tem_carro,Tem_casa_propria,Qtd_filhos,Rendimento_anual,Categoria_de_renda,Grau_escolaridade,Estado_civil,Moradia,Idade,Anos_empregado,Tem_telefone_trabalho,Tem_telefone_fixo,Tem_email,Ocupacao,Tamanho_familia
0,5008804,1,1,0,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,-12005,-4542,1,0,0,Outro,2.0
1,5008805,1,1,0,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,-12005,-4542,1,0,0,Outro,2.0
2,5008806,1,1,0,112500.0,Empregado,Ensino médio,Casado,Casa/apartamento próprio,-21474,-1134,0,0,0,Segurança,2.0
3,5008808,0,1,0,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,-19110,-3051,0,1,1,Vendas,1.0
4,5008809,0,1,0,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,-19110,-3051,0,1,1,Vendas,1.0

In [56]:
df_cadastrados_limpo["Idade"] = - df_cadastrados_limpo["Idade"] / 365.2425 #a idade está em contagem regressivo, por isso estamos dividindo pela qiantaidade de dias

In [57]:
df_cadastrados_limpo['Anos_empregado']=-df_cadastrados_limpo['Anos_empregado']/365.2425

In [58]:
df_cadastrados_limpo.head()

,ID_Cliente,Tem_carro,Tem_casa_propria,Qtd_filhos,Rendimento_anual,Categoria_de_renda,Grau_escolaridade,Estado_civil,Moradia,Idade,Anos_empregado,Tem_telefone_trabalho,Tem_telefone_fixo,Tem_email,Ocupacao,Tamanho_familia
0,5008804,1,1,0,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,32.868574,12.435574,1,0,0,Outro,2.0
1,5008805,1,1,0,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,32.868574,12.435574,1,0,0,Outro,2.0
2,5008806,1,1,0,112500.0,Empregado,Ensino médio,Casado,Casa/apartamento próprio,58.793815,3.104787,0,0,0,Segurança,2.0
3,5008808,0,1,0,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,52.321403,8.353354,0,1,1,Vendas,1.0
4,5008809,0,1,0,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,52.321403,8.353354,0,1,1,Vendas,1.0

In [59]:
df_cadastrados_limpo.loc[df_cadastrados_limpo['Anos_empregado']<0,'Anos_empregado']=0  #se for menos que zero, colocar 0 h

In [60]:
import matplotlib.pyplot as plt
import seaborn as sns

In [66]:
corr = df_cadastrados_limpo.corr()
plt.figure(figsize = (20,10))
sns.heatmap(corr, cmap="Blues", annot=True)

ValueError: could not convert string to float: 'Empregado'

In [ ]:
df_cadastrados_limpo.drop(['Qtd_filhos'], axis=1, inplace=True) #excluindo coluna

In [63]:
df_cadastrados_limpo.head()

,ID_Cliente,Tem_carro,Tem_casa_propria,Rendimento_anual,Categoria_de_renda,Grau_escolaridade,Estado_civil,Moradia,Idade,Anos_empregado,Tem_telefone_trabalho,Tem_telefone_fixo,Tem_email,Ocupacao,Tamanho_familia
0,5008804,1,1,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,32.868574,12.435574,1,0,0,Outro,2.0
1,5008805,1,1,427500.0,Empregado,Ensino superior,União-estável,Apartamento alugado,32.868574,12.435574,1,0,0,Outro,2.0
2,5008806,1,1,112500.0,Empregado,Ensino médio,Casado,Casa/apartamento próprio,58.793815,3.104787,0,0,0,Segurança,2.0
3,5008808,0,1,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,52.321403,8.353354,0,1,1,Vendas,1.0
4,5008809,0,1,270000.0,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,52.321403,8.353354,0,1,1,Vendas,1.0

In [67]:
df_cadastrados_limpo = df_cadastrados_limpo[['ID_Cliente', 'Tem_carro', 'Tem_casa_propria', 
                                           'Tem_telefone_trabalho', 'Tem_telefone_fixo', 'Tem_email',
                                           'Tamanho_familia', 'Rendimento_anual', 'Idade', 'Anos_empregado',
                                           'Categoria_de_renda', 'Grau_escolaridade', 'Estado_civil',
                                           'Moradia', 'Ocupacao']]

In [69]:
df_cadastrados_limpo.head()

,ID_Cliente,Tem_carro,Tem_casa_propria,Tem_telefone_trabalho,Tem_telefone_fixo,Tem_email,Tamanho_familia,Rendimento_anual,Idade,Anos_empregado,Categoria_de_renda,Grau_escolaridade,Estado_civil,Moradia,Ocupacao
0,5008804,1,1,1,0,0,2.0,427500.0,32.868574,12.435574,Empregado,Ensino superior,União-estável,Apartamento alugado,Outro
1,5008805,1,1,1,0,0,2.0,427500.0,32.868574,12.435574,Empregado,Ensino superior,União-estável,Apartamento alugado,Outro
2,5008806,1,1,0,0,0,2.0,112500.0,58.793815,3.104787,Empregado,Ensino médio,Casado,Casa/apartamento próprio,Segurança
3,5008808,0,1,0,1,1,1.0,270000.0,52.321403,8.353354,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,Vendas
4,5008809,0,1,0,1,1,1.0,270000.0,52.321403,8.353354,Associado comercial,Ensino médio,Solteiro,Casa/apartamento próprio,Vendas

In [72]:
df_cadastrados_limpo["Categoria_de_renda"].value_counts(normalize=True)*100

Categoria_de_renda
Empregado              51.557144
Associado comercial    22.972520
Pensionista            17.214223
Servidor público        8.252236
Estudante               0.003877
Name: proportion, dtype: float64

## Aula 2 - Criando a variável target

In [73]:
aprovados = pd.read_csv("https://raw.githubusercontent.com/FIAP/Pos_Tech_DTAT/dd201a034223a16732c6f639b40600b26bd3129c/dados/clientes_aprovados.csv")

In [74]:
aprovados.info()

<class 'pandas.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID_Cliente      1048575 non-null  int64
 1   Mes_referencia  1048575 non-null  int64
 2   Faixa_atraso    1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [75]:
aprovados.head()

   ID_Cliente  Mes_referencia         Faixa_atraso
0     5001711               0    nenhum empréstimo
1     5001711              -1            1-29 dias
2     5001711              -2            1-29 dias
3     5001711              -3            1-29 dias
4     5001712               0  pagamento realizado

In [76]:
aprovados.query('ID_Cliente == 5001712') #olhando um dos clientes, para ver como isso está organizado

    ID_Cliente  Mes_referencia         Faixa_atraso
4      5001712               0  pagamento realizado
5      5001712              -1  pagamento realizado
6      5001712              -2  pagamento realizado
7      5001712              -3  pagamento realizado
8      5001712              -4  pagamento realizado
9      5001712              -5  pagamento realizado
10     5001712              -6  pagamento realizado
11     5001712              -7  pagamento realizado
12     5001712              -8  pagamento realizado
13     5001712              -9            1-29 dias
14     5001712             -10            1-29 dias
15     5001712             -11            1-29 dias
16     5001712             -12            1-29 dias
17     5001712             -13            1-29 dias
18     5001712             -14            1-29 dias
19     5001712             -15            1-29 dias
20     5001712             -16            1-29 dias
21     5001712             -17            1-29 dias
22     5001712             -18            1-29 dias

In [78]:
aprovados.query('ID_Cliente == 5001711') #olhando um dos clientes, para ver como isso está organizado

   ID_Cliente  Mes_referencia       Faixa_atraso
0     5001711               0  nenhum empréstimo
1     5001711              -1          1-29 dias
2     5001711              -2          1-29 dias
3     5001711              -3          1-29 dias

In [ ]:
aprovados.Faixa_atraso.value_counts().index.to_list() #puxando as informações da coluna

['pagamento realizado',
 '1-29 dias',
 'nenhum empréstimo',
 '30-59 dias',
 '>150 dias',
 '60-89 dias',
 '90-119 dias',
 '120-149 dias']

In [ ]:
df_registros_creditos_agrupados_ID = aprovados.groupby('ID_Cliente') #agrupar por ID
ser_abertura = df_registros_creditos_agrupados_ID.apply(lambda x: min(x['Mes_referencia'])) #mes qye foi aberto
ser_abertura.name = 'Abertura'
ser_abertura

C:\Users\aila.endo\AppData\Local\Temp\ipykernel_19528\1838169563.py:2: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  ser_abertura = df_registros_creditos_agrupados_ID.apply(lambda x: min(x['Mes_referencia']))

ID_Cliente
5001711    -3
5001712   -18
5001713   -21
5001714   -14
5001715   -59
           ..
5150482   -28
5150483   -17
5150484   -12
5150485    -1
5150487   -29
Name: Abertura, Length: 45985, dtype: int64

In [81]:
df_clientes_aprovados = aprovados.merge(ser_abertura, on='ID_Cliente')

In [83]:
df_clientes_aprovados.head()

   ID_Cliente  Mes_referencia         Faixa_atraso  Abertura
0     5001711               0    nenhum empréstimo        -3
1     5001711              -1            1-29 dias        -3
2     5001711              -2            1-29 dias        -3
3     5001711              -3            1-29 dias        -3
4     5001712               0  pagamento realizado       -18

In [84]:

ser_final = df_registros_creditos_agrupados_ID.apply(lambda x: max(x['Mes_referencia']))
ser_final.name = 'Final'
ser_final

C:\Users\aila.endo\AppData\Local\Temp\ipykernel_19528\3418624829.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  ser_final = df_registros_creditos_agrupados_ID.apply(lambda x: max(x['Mes_referencia']))

ID_Cliente
5001711     0
5001712     0
5001713     0
5001714     0
5001715     0
           ..
5150482   -11
5150483     0
5150484     0
5150485     0
5150487     0
Name: Final, Length: 45985, dtype: int64

In [85]:
df_clientes_aprovados = df_clientes_aprovados.merge(ser_final, on='ID_Cliente')
df_clientes_aprovados.head()

   ID_Cliente  Mes_referencia         Faixa_atraso  Abertura  Final
0     5001711               0    nenhum empréstimo        -3      0
1     5001711              -1            1-29 dias        -3      0
2     5001711              -2            1-29 dias        -3      0
3     5001711              -3            1-29 dias        -3      0
4     5001712               0  pagamento realizado       -18      0

In [86]:
df_clientes_aprovados['Janela'] = df_clientes_aprovados['Final'] - df_clientes_aprovados['Abertura']
df_clientes_aprovados.head()

   ID_Cliente  Mes_referencia         Faixa_atraso  Abertura  Final  Janela
0     5001711               0    nenhum empréstimo        -3      0       3
1     5001711              -1            1-29 dias        -3      0       3
2     5001711              -2            1-29 dias        -3      0       3
3     5001711              -3            1-29 dias        -3      0       3
4     5001712               0  pagamento realizado       -18      0      18